In [1]:
import pandas as pd
import numpy as np

In [2]:
areas = ['City of London', 'Barking and Dagenham', 'Barnet', 'Bexley', 'Brent', 'Bromley', 'Camden', 'Croydon', 'Ealing', 'Enfield', 'Greenwich', 'Hackney', 'Hammersmith and Fulham', 'Haringey', 'Harrow', 'Havering', 'Hillingdon', 'Hounslow', 'Islington', 'Kensington and Chelsea', 'Kingston upon Thames', 'Lambeth', 'Lewisham', 'Merton', 'Newham', 'Redbridge', 'Richmond upon Thames', 'Southwark', 'Sutton', 'Tower Hamlets', 'Waltham Forest', 'Wandsworth', 'Westminster']

##  Average Income

In [13]:
# first row is the title so we skip it
median_gross_anual_earnings = pd.read_excel('data/income.xlsx', skiprows=1,  sheet_name= '5b')

# Keep only london as a region
median_gross_anual_earnings.drop(median_gross_anual_earnings[median_gross_anual_earnings['Region name '] != 'London'].index, inplace = True)

# Delete columns not needed
del median_gross_anual_earnings['Region code']
del median_gross_anual_earnings['Region name ']

# rename column
median_gross_anual_earnings.rename(columns = {'Name': 'Area'}, inplace= True)

# reset index
median_gross_anual_earning = median_gross_anual_earnings.reset_index(drop = True)

# save clean data
median_gross_anual_earning = median_gross_anual_earning[['Code','Area',2011,2012,2013,2014,2015,2016,2017]]
median_gross_anual_earning = pd.melt(median_gross_anual_earning, id_vars=['Code','Area'], var_name='Year', value_name='median_gross_anual_earning')

median_gross_anual_earning.rename(columns = {'median_gross_anual_earning': 'Median_annual_earning' }, inplace= True)


median_gross_anual_earning.to_csv('clean_data/median_gross_annual_earning.csv',index=False)
median_gross_anual_earning

          Code                  Area  Year Median_annual_earning
0    E09000001        City of London  2011                 54381
1    E09000002  Barking and Dagenham  2011                 28201
2    E09000003                Barnet  2011                 30237
3    E09000004                Bexley  2011                 28638
4    E09000005                 Brent  2011                 26772
..         ...                   ...   ...                   ...
226  E09000029                Sutton  2017                 27945
227  E09000030         Tower Hamlets  2017                 49369
228  E09000031        Waltham Forest  2017                 28284
229  E09000032            Wandsworth  2017                 33137
230  E09000033           Westminster  2017                 42152

[231 rows x 4 columns]

## Average House Price

In [15]:
house_price = pd.read_excel('data/house price.xls', sheet_name= 'Median') # Can be changed to Mean

# For every year, apart from 1995, the house price is recorded 4 times a year: Mar, Jun, Sep, and Dec.
# Because for 1995 only Dec is available, we will choose Dec as the month and remove all entries that don't have it.
for label in house_price.columns[2:]:
    #label format = Year Ending Jun 1996
    lis = list(label.split(" "))
    length = len(lis)

    # if Month is not Dec, remove column
    if lis[length -2] != 'Dec':
        house_price = house_price.drop([label], axis = 1)

    # Additionally, let's rename the column to be consistent, keeping only the year:
    house_price.rename(columns = {label: lis[length -1]}, inplace= True)

for area_london in house_price['Area']:
    if area_london not in areas:
        house_price = house_price[house_price['Area']!=area_london]

#Drop rows with NaN: in this case they were empty rows
house_price = house_price.dropna()
# save clean data

house_price = house_price[['Code','Area','2011','2012','2013','2014','2015','2016','2017']]
house_price = pd.melt(house_price, id_vars=['Code','Area'], var_name='Year', value_name='median_house_price')

house_price.rename(columns = {'median_house_price': 'Median_house_price' }, inplace= True)


house_price.to_csv('clean_data/median_house_price.csv', index=False)
house_price

          Code                  Area  Year  Median_house_price
0    E09000001        City of London  2011            465000.0
1    E09000002  Barking and Dagenham  2011            170000.0
2    E09000003                Barnet  2011            325000.0
3    E09000004                Bexley  2011            215000.0
4    E09000005                 Brent  2011            300000.0
..         ...                   ...   ...                 ...
226  E09000029                Sutton  2017            367000.0
227  E09000030         Tower Hamlets  2017            490000.0
228  E09000031        Waltham Forest  2017            445000.0
229  E09000032            Wandsworth  2017            654000.0
230  E09000033           Westminster  2017           1025000.0

[231 rows x 4 columns]

## Personal Well-Being (Life-Satisfaction)

In [17]:
personal_well_being = pd.read_excel('data/well-being.xlsx', skiprows=1, sheet_name= 'Summary - Mean Scores')

# rename column by removing last 3 digits
for label in personal_well_being.columns[2:]:
    #print(label)
    personal_well_being.rename(columns = {label: label[:-3]}, inplace= True)

# Now, I know that the first 8 columns relate to Life Satisfaction, the rest relate to other Scores so let's filter it out. We select 10 because we have columns for code and area
personal_well_being = personal_well_being.iloc[:, list(range(10))]

# Now, fisrt row is empty, let's remove it
personal_well_being = personal_well_being.drop([personal_well_being.index[0]])

for area_london in personal_well_being['Area']:
    if area_london not in areas:
        personal_well_being = personal_well_being[personal_well_being['Area'] != area_london]

# Now, last rows have only NaN , let's remove them
personal_well_being = personal_well_being.drop([personal_well_being.index[33], personal_well_being.index[34], personal_well_being.index[35]])

# save clean data
personal_well_being = personal_well_being.replace('x',np.nan)
personal_well_being = personal_well_being[['Code','Area','2011','2012','2013','2014','2015','2016','2017']]
personal_well_being = pd.melt(personal_well_being, id_vars=['Code','Area'], var_name='Year', value_name='personal_well_being')
personal_well_being.dropna(inplace=True)

personal_well_being.rename(columns = {'personal_well_being': 'Mean_life_satisfaction' }, inplace= True)

personal_well_being.to_csv('clean_data/personal_well_being.csv', index=False)

personal_well_being

          Code                  Area  Year  Mean_life_satisfaction
1    E09000002  Barking and Dagenham  2011                    7.05
2    E09000003                Barnet  2011                    7.43
3    E09000004                Bexley  2011                    7.42
4    E09000005                 Brent  2011                    7.11
5    E09000006               Bromley  2011                    7.50
..         ...                   ...   ...                     ...
226  E09000029                Sutton  2017                    7.91
227  E09000030         Tower Hamlets  2017                    7.51
228  E09000031        Waltham Forest  2017                    7.73
229  E09000032            Wandsworth  2017                    7.64
230  E09000033           Westminster  2017                    7.57

[224 rows x 4 columns]